Repository: TeachBlox/academy
Catalog: lib/l10n/translations/app_*.arb
Languages: ru

# link_aboutPlatform
source: About Platform
ru: Платформа

# link_courses
source: Courses
ru: Курсы

# link_forTeachers
source: For Teachers
ru: Учителям

# link_contacts
source: Contacts
ru: Контакты

source: Login
ru: Войти

source: Register
ru: Регистрация

source: Logout
ru: Выйти

source: Get Started
ru: Начать

source: Start Learning
ru: Начать обучение

# landingScreen_title
source: Learn your way with
ru: Учись как тебе удобно с

# landingScreen_titleDescription
source: Start with introductory modules and choose your specialization in Web3 and programming
ru: Начни с вводных модулей и выбери свою специализацию в Web3 и программировании

# landingScreen_statistic_developers
source: of developers worldwide work in Web3 today
ru: разработчиков по всему миру работают в Web3 сегодня

# landingScreen_statistic_growth
source: is the annual growth rate of the Web3 market
ru: ежегодный темп роста рынка Web3

# landingScreen_statistic_salary
source: higher salaries are earned by Web3 developers
ru: выше доходы у Web3 разработчиков

# landingScreen_howItWorks_title
source: How it works
ru: Как это работает

# landingScreen_howItWorks_subtitle
source: 4 simple steps to start
ru: 4 простых шага для старта

# landingScreen_howItWorks_description
source: Learn, earn, and grow with a step-by-step journey to Web3 success
ru: Учись, зарабатывай и развивайся, шаг за шагом осваивая Web3

# landingScreen_howItWorks_step1_title
source: Start
ru: Старт

# landingScreen_howItWorks_step1_description
source: Sign up and start with introductory modules
ru: Зарегистрируйся и начни с вводных модулей

# landingScreen_howItWorks_step2_title
source: Learning
ru: Обучение

# landingScreen_howItWorks_step2_description
source: Choose your learning path through a tree-like structure
ru: Выбери свой путь обучения в древовидной структуре

# landingScreen_howItWorks_step3_title
source: Practice
ru: Практика

# landingScreen_howItWork_step3_description
source: Complete tasks, earn rewards, and gain certificates
ru: Выполняй задания, получай награды и сертификаты

# landingScreen_howItWorks_step4_title
source: Career
ru: Карьера

# landingScreen_howItWorks_step4_description
source: Build your career as a Web3 developer with TeachBlox
ru: Строй карьеру Web3-разработчика вместе с TeachBlox

# landingScreen_why_choose_us_title
source: Why choose TeachBlox?
ru: Почему выбирают TeachBlox?

# landingScreen_why_choose_us_subtitle
source: Why we stand out
ru: Что нас выделяет

# landingScreen_why_choose_us_description
source: Discover personalized learning, AI-powered feedback, blockchain certification, and gamified experiences
ru: Персонализированное обучение, AI-оценка, сертификация на блокчейне и геймификация

# landingScreen_why_choose_us_block1_title
source: Custom Learning Path
ru: Индивидуальная траектория обучения

# landingScreen_why_choose_us_block1_description
source: Follow an adaptive tree-based course structure tailored to your progress
ru: Учись по индивидуальной программе с адаптивной древовидной структурой курсов

# landingScreen_why_choose_us_block2_title
source: AI-Powered Knowledge
ru: AI-оценка

# landingScreen_why_choose_us_block2_description
source: AI analyzes your progress and dynamically adjusts your learning plan
ru: Искусственный интеллект анализирует твой прогресс и корректирует программу обучения

# landingScreen_why_choose_us_block3_title
source: Digital Certification
ru: Цифровая сертификация

# landingScreen_why_choose_us_block3_description
source: Earn secure NFT certificates that verify your skills and achievements
ru: Получай защищенные NFT-сертификаты, подтверждающие твои навыки и достижения

# landingScreen_why_choose_us_block4_title
source: Gamification
ru: Геймификация

# landingScreen_why_choose_us_block4_description
source: Take on challenges, earn TBT tokens, and compete with other learners
ru: Проходи челленджи, зарабатывай TBT-токены и соревнуйся с другими участниками

# landingScreen_courses_title
source: Courses
ru: Курсы

# landingScreen_courses_subtitle
source: Choose Your Path
ru: Выбери свой путь

# landingScreen_courses_description
source: Explore diverse learning paths and tailor your journey to your goals
ru: Исследуйте различные направления обучения и подстраивайте обучение под свои цели

# landingScreen_courses_block1_title
source: Blockchain Fundamentals
ru: Основы блокчейна

# landingScreen_courses_block1_description
source: Learn the core principles of blockchain and its practical applications
ru: Изучите ключевые принципы блокчейна и его практическое применение

# landingScreen_courses_block2_title
source: Frontend Development
ru: Фронтенд-разработка

# landingScreen_courses_block2_description
source: Master frameworks like React and Vue to create dynamic user interfaces
ru: Освойте фреймворки, такие как React и Vue, для создания динамичных интерфейсов

# landingScreen_courses_block3_title
source: Telegram Web Apps & TWA Apps
ru: Telegram Web Apps и TWA-приложения

# landingScreen_courses_block3_description
source: Build interactive Telegram Web Apps and decentralized apps with TWA
ru: Создавайте интерактивные Telegram Web Apps и децентрализованные приложения с TWA

# landingScreen_courses_block4_title
source: Smart contracts development
ru: Разработка смарт-контрактов

# landingScreen_courses_block4_description
source: Create secure smart contracts to power innovative blockchain solutions
ru: Создавайте безопасные смарт-контракты для реализации инновационных блокчейн-решений
